#include <stdio.h>
//#include <conio.h>
#include <cstdlib>
#include <iostream>
#include <math.h>
#include <stdlib.h>

int main()
{
        setlocale(LC_NUMERIC, "C");
        float a[50][51], t, ra, def=1;
        int j, i, k, n;
        puts("Введіть розмір матриці:");
        scanf("%i",&n);

        //    Зчитуємо матрицю
        // for (i = 0; i < n; i++)
        // {
        //         for (j = 0; j < n; j++) {
        //                 std::cout <<"a["<<i+1<<"]["<<j+1<<"]: ";
        //                 std::cin >> ra;
        //                 a[i][j]=ra;
        //         }
        // }


        a[0][0] = 8.3;
        a[0][1] = 2.72;
        a[0][2] = 4.1;
        a[0][3] = 1.9;
        a[1][0] = 3.92;
        a[1][1] = 8.45;
        a[1][2] = 7.68;
        a[1][3] = 2.46;
        a[2][0] = 3.77;
        a[2][1] = 7.31;
        a[2][2] = 8.04;
        a[2][3] = 2.28;
        a[3][0] = 2.21;
        a[3][1] = 3.55;
        a[3][2] = 1.69;
        a[3][3] = 6.69;


        // Виводимо початкову матрицю
        printf("\n Матриця: \n \n");
        for (i = 0; i < n; i++)
        {
                for (j = 0; j < n; j++)
                        printf("%6.2f\t", a[i][j]);
                printf("\n");
        }

        // Опускаємо рядок, який містить 0-значення до низу матриці, щоб потім не помилитися зі знаком, при розрахунку визначника
        for (i = 0; i < n; i++) {
                if (a[i][j] == 0.0)
                {
                        k = i;
                        while ((a[k][i] == 0.0) && (k < n))
                                k++;
                }
                if (a[k][i] != 0)
                        for (j = 0; j < n; j++)
                        {
                                t = a[i][j];
                                a[i][j] = a[k][j];
                                a[k][j] = t;
                        }
        }

        // Перетворюємо матрицю у трикутну шляхом відмімання від будь-якого рядка матриці іншого рядка, помноженого на ненульове число.
        for (k = 0; k < n - 1; k++)
                for (i = k + 1; i < n; i++)
                {
                        if (a[k][k] !=0)
                        {
                                t = a[i][k] / a[k][k];
                                for (j = 0; j < n + 1; j++)
                                        a[i][j] = (-1)*(a[k][j] * t) + a[i][j];
                        }
                }

        printf("\n Матриця зводиться до трикутної форми:\n\n");
        for (i = 0; i < n; i++)
        {
                for (j = 0; j < n; j++)
                        printf("%6.2f\t", a[i][j]);
                printf("\n");
        }
        for(i=0; i<n; i++) {
                def=a[i][i]*def;
        }
        std::cout << "\n Визначник = " << def << '\n';
        return 0;
}
